In [93]:
import pandas as pd
import numpy as np
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

e1 = pd.Series(exam1,labels)
e1

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [94]:
exam2 = [74,56,44,92]
e2 = pd.Series(exam2,labels)
e2

Student A    74
Student B    56
Student C    44
Student D    92
dtype: int64

In [95]:
pd.Series(exam1,labels)['Student D']

83

In [96]:
d = {s:p for s,p in zip(labels,exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [97]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [98]:
#e1+e2

In [99]:
#e1*e2

In [100]:
#e1 / 5

In [101]:
df = pd.DataFrame({"e1": exam1, "e2": exam2},index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [102]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [103]:
df['e2']

Student A    74
Student B    56
Student C    44
Student D    92
Name: e2, dtype: int64

In [104]:
data = np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [105]:
df = pd.DataFrame(data.transpose(),index=labels,columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [106]:
df.shape

(4, 2)

In [107]:
#kolumny ['e3'] wcześniej nie było w, zostaje ona w zapisie poniżej automatycznie utworzona
df['e3'] = [67,59,79,84]
df

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [108]:
df['semestr 1'] = df['e1']+df['e2']+df['e3']
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [109]:
df.loc['Student C']

e1            93
e2            44
e3            79
semestr 1    216
Name: Student C, dtype: int64

In [110]:
df.loc['Student C','e1']

93

In [111]:
df.iloc[3]

e1            83
e2            92
e3            84
semestr 1    259
Name: Student D, dtype: int64

In [112]:
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32

In [113]:
#Masking na podstawie wyrażen logicznych
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [114]:
df['e2'] > 70

Student A     True
Student B    False
Student C    False
Student D     True
Name: e2, dtype: bool

In [115]:
df[df['e2']> 70]

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student D  83  92  84        259

In [116]:
#df.drop('semestr 1',axis=1)

In [117]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [118]:
#df.drop('e1',axis=1)

In [119]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [120]:
#df.drop(['e3','semestr 1'],axis=1,inplace=True)

In [121]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [122]:
#df.drop('Student B',inplace=True)

In [123]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [124]:
df.reset_index()

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [125]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [126]:
#resetowanie i usuwanie indeksu, sposob 1 - funkcja set_index

In [127]:
df_new_index = df.reset_index()
df_new_index

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [129]:
df_new_index['student_name'] = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index

       index  e1  e2  e3  semestr 1 student_name
0  Student A  89  74  67        230       Adrian
1  Student B  85  56  59        200   Bartłomiej
2  Student C  93  44  79        216       Celina
3  Student D  83  92  84        259      Dagmara

In [130]:
df_new_index.set_index('student_name')

                  index  e1  e2  e3  semestr 1
student_name
Adrian        Student A  89  74  67        230
Bartłomiej    Student B  85  56  59        200
Celina        Student C  93  44  79        216
Dagmara       Student D  83  92  84        259

In [131]:
#resetowanie i usuwanie indeksu, sposob 2 - zmiany bezposrednio na atrybucie index

In [132]:
df_new_index2 = df.reset_index()
df_new_index2

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [133]:
df_new_index2.index = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index2

                index  e1  e2  e3  semestr 1
Adrian      Student A  89  74  67        230
Bartłomiej  Student B  85  56  59        200
Celina      Student C  93  44  79        216
Dagmara     Student D  83  92  84        259

In [136]:
df.rename(columns={'e1':'exam1','e2':'exam2','e3':'exam3'})

           exam1  exam2  exam3  semestr 1
Student A     89     74     67        230
Student B     85     56     59        200
Student C     93     44     79        216
Student D     83     92     84        259